namespace MonsterCompanySimModel.Models
{
    /// <summary>
    /// スキル種類
    /// </summary>
    public enum SkillType
    {
        属性強化,
        タイプ強化,
        CT確定,
        CT回避,
        被CT確定,
        一色編成強化,
        三色編成強化,
        タイプキラー,
        タイプCT確定,
        同族キラー,
        オールキラー,
        属性軽減,
        タイプ軽減,
        弱点無効,
        全属性軽減,
        全員引き付け,
        正面攻撃,
        正面引き付け,
        くる,
        二人強化,
        一人強化,
        こなす,
        特定社員強化,
        特定社員強化_進化指定,
        デストロイヤー,
        味方タイプ反応,
        一タイプ編成強化,
        味方属性不在,
        属性別タイプキラー
    }
}